
-- Ä«·ç½º ½ºÆÄÀÌ
-- ±×³É ´Ý±â 101

-- EVENT ´Â 100¹ø ÀÌ»ó ºÎÅÍ »ç¿ëÇÏ¶ó

-- UID : ¼­¹ö¿¡¼­ Á¦°øÇÏ´Â À¯Àú¹øÈ£
-- EVENT : ¼­¹ö¿¡¼­ Á¦°øÇÏ´Â Äù½ºÆ® ¹øÈ£
-- STEP : ¼­¹ö¿¡¼­ Á¦°øÇÏ´Â Äù½ºÆ® ³»ºÎ ´Ü°è

-- À§ÀÇ ¼¼°¡Áö ÆÄ¶ó¸ÞÅ¸´Â ·ç¾Æ ½ÇÇà½Ã Ç×»ó Àü¿ªº¯¼ö·Î Á¦°øµ

-- Áö¿ªº¯¼ö ¼±¾ð...
local UserClass;
local QuestNum;
local Ret = 0;
local NPC= 24408; --NPC ¹øÈ£ 


-- Ä«·ç½º ½ºÆÄÀÌ Äù½ºÆ® Ã¼Å©  

if EVENT == 100 then
	QuestNum = SearchQuest(UID, NPC);
		if QuestNum == 0 then --ÇØ´ç NPC¿¡°Ô ÇÒ¼ö ÀÖ´Â Äù½ºÆ®°¡ 0°³ ÀÏ¶§ 
			 SelectMsg(UID, 2, -1, 4187, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
			 Ret = 1; 
		elseif QuestNum > 1 and QuestNum < 100 then--ÇØ´ç NPC¿¡°Ô ÇÒ¼ö ÀÖ´Â Äù½ºÆ®°¡ 1°³ ÀÏ¶§ 
          NpcMsg(UID, 4188, NPC)
      else--ÇØ´ç NPC¿¡°Ô ÇÒ¼ö ÀÖ´Â Äù½ºÆ®°¡ 1°³ ÀÌ»ó ÀÏ¶§ 
          EVENT = QuestNum
		end
end

if EVENT == 101 then -- ±×³É ´Ý±â 
    Ret = 1;
end


-----------------------------------------------------------
-- ´ÙÅ©·ç³ª ½ÃÀÛ 

local savenum = 63;
local Level
local NATION
-----------------------------------------------------------

-- Ä«·ç½º ½ºÆÄÀÌ  63¹øÀÇ ¼Ó¼º 0¹ø 4¹øÀÏ °æ¿ì

if EVENT == 105 then
    SelectMsg(UID, 2, savenum, 4189, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

--Ä«·ç½º ½ºÆÄÀÌ 63¹øÀÇ ¼Ó¼º 1¹ø 3¹øÀÏ °æ¿ì

   local ItemA = 0;

if EVENT == 110 then 
    SelectMsg(UID, 2, savenum, 4190, NPC, 4170, 120, 4169, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end


if EVENT == 120 then 
    ItemA = HowmuchItem(UID, 910084000);  
   if  ItemA == 0 then 
    GiveItem(UID, 910084000, 1);
    SaveEvent(UID,4186);   
   else
    SelectMsg(UID, 2, savenum, 4191, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   end
end
-----------------------------------------------------------
-- ´ÙÅ©·ç³ª ³¡ 
-----------------------------------------------------------

-----------------------------------------------------------
-- ·ç³ª ½ÃÀÛ 
local savenum = 64;
local Level
local NATION
-----------------------------------------------------------

-- Ä«·ç½º ½ºÆÄÀÌ 64¹øÀÇ ¼Ó¼º 0¹ø 4¹øÀÏ °æ¿ì

if EVENT == 125 then
    SelectMsg(UID, 2, savenum, 4189, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end

--Ä«·ç½º ½ºÆÄÀÌ 64¹øÀÇ ¼Ó¼º 1¹ø 3¹øÀÏ °æ¿ì

local ItemA = 0;


if EVENT == 130 then 
    SelectMsg(UID, 2, savenum, 4192, NPC, 4170, 140, 4169, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
end


if EVENT == 140 then 
    ItemA = HowmuchItem(UID, 910085000);  
   if  ItemA == 0 then 
    GiveItem(UID, 910085000, 1);
    SaveEvent(UID,4191);   
   else
    SelectMsg(UID, 2, savenum, 4193, NPC, 10, 101, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1);
   end
end

-----------------------------------------------------------
-- ·ç³ª ³¡ 
-----------------------------------------------------------
